;====== Программа 12.  Файл z4_pr12.asm ====================
masm 
model   small 
.stack  128 
.data 
mess1   	db      0Ah,0Dh
			db      '        O D I T S Z   A   P   C', 0Ah,0Dh
			db      '        F F F F F F * F * F * F', 0Ah,0Dh
			db      '_______________________________'
			db      0Ah,0Dh,'$' 
.code 
myproc  proc             
		assume  CS:@code, DS:@data, SS:@stack
        mov     AX,@data
        mov     DS,AX
;---------------------------------------------------------
        lea     DX,mess1	  				;загрузка в DX смещения на mess1
        mov     AH,09h	  					;функция 09h вывода строки
        int     21h
;---------------------------------------------------------
        xor     AX,AX						;вычитание(очистка регистра AX), 
											;устанавливаются флаги
		;sub     AX,1						;Бесконечный цикл - УГАДАЙ ПОЧЕМУ
        pushf								;содержимое регистра флагов в стек
;---------------------------------------------------------
        pop     BX							;извлечение из стека в регистр BX
        mov     CX,10h	
p1:     rol     BX,1						;циклический сдвиг влево на один
											;разряд - содержимое выталкиваемого ;15 бита помещается в 0 бит 
        mov     AL,BL 
		and 	AL,1 
		or 		AL,30h						;Формирование ASCII кода 0 или 1         
		mov     DL,AL         
		mov     AH,2						;Функция 2h вывода символа на экран
        int     21h
        mov     DL,' '
        mov     AH,2
        int     21h
;---------------------------------------------------------
        dec	 	CX
        cmp     CX,0
        jne	 	p1							;Переход по условию на метку р1
		;loop    p1							;ЦИКЛ БЕЗ КОНЦА - УГАДАЙ ПОЧЕМУ
;---------------------------------------------------------
        mov     AX,4C00h
        int     21h
myproc  endp
        end     myproc
;===========================================================
