;====== Программа 17.  Файл z5_pr17.asm ====================
MASM 
MODEL	small 
STACK	256
;=====================================================================================================================================================
.data 																	;матрица размером 2х5 - если ее не инициализировать, то для
																		;наглядности она может быть описана так: ;array dw 2 DUP (5 DUP (?))
																		;но мы ее инициализируем:
array	dw	32766,150,3078,526,61,8,443,9,11,12,13,0

elem	dw	1															;элемент для поиска 
failed	db	0ah,0dh,'Chet elementov net!','$'
success db 0ah,0dh,'Est chet elementi!','$'
foundtime	db ?														;количество найденных элементов
fnd	db	'time(s)',0ah,0dh,'$' 
;=====================================================================================================================================================
.code 
main: 	
	mov			ax,@data 	
	mov			ds,ax 	
	
	xor			ax,ax 	
	xor			si,si													;si=столбцы в матрице 	mov	bx,0				
																		;bx=строки в матрице
	mov			cx,12
check:
	xor			ax,ax
	mov			ax,array[SI]
	add			si,2
	test		ax,1
	jnz			nechet
	inc			foundtime
	nechet:
	loop		check
;----------------------------------------------------------------------------------------------------------------------------
;============================================================================================================================

	cmp			foundtime,0h											;сравнение числа совпавших с 0
	ja			eql														;если больше 0, то переход
not_equal:																;нет элементов, совпавших с искомым
	mov			ah,09h													;вывод сообщения на экран
	mov			dx,offset failed
	int			21h
	jmp			exit													;на выход
eql:																	;есть элементы, совпавшие с искомым
	mov			ah,09h													;вывод сообщений на экран
	mov			dx,offset success
	int			21h
	mov			ah,02h
	mov			dl,foundtime
	add			dl,30h
	int			21h
	mov			ah,09h
	mov			dx,offset fnd
	int			21h
;---------------------------------------------------------------------------------------------------------------------------
exit:
	mov			ax,4c00h												;стандартное завершение программы
	int			21h
;===========================================================================================================================
end	main																;конец программы
;===========================================================================================================================