;====== Программа 18   Файл z6_pr18.asm ====================
;==================================================================================================================
											;Основные фрагменты программы
											;Макроопределение для программной задержки
											;Параметр = задержка в секундах
delay	macro	time						;Имя delay, параметр time
local	outer,inner,globalout				;Локальные метки
		xor		CX,CX
		mov 	CX,time
		
globalout:
		push	CX
		mov		CX,9900
outer:						
		push	CX
		mov		CX,0
inner:	loop	inner				
		pop		CX
		loop	outer
		pop		CX
		loop	globalout
		endm								;Конец макроопределения
;------------------------------------------------------------------------------------------------------------------
											;Макроопределение вывода строки на экран
											;Первый параметр = адрес строки, второй параметр = ее длина
;==================================================================================================================
MASM 
MODEL	tiny 
;==================================================================================================================
.data 																	
;Поля данных
;------------------------------------------------------------------------------------------------------------------
	m1	db		'<> '
	m2	db		'*** '
	m3	db		'!'
;==================================================================================================================
.code
		org		100h						;Начало главной процедуры
	
	outstring	macro	mes,len		
	mov		AH,	40h							;номер функции вывода в байт AH
	mov		BX,1							;дискриптор монитора в регистр BX
	mov		CX,len							;длину сообщения в регистр CX
	mov		DX,offset mes					;адрес (смещение) mes в регистр DX
	int		21h								;прерывание MS DOS, которое при
											;наличии функции 40h в байте AH
											;выводит строку на экран 
											;Завершение программы – возвращение в родительский процесс
	endm									;Конец макроопределения

	
myproc	proc
		mov		AX,@data					;Инициализация сегментного 
		mov		DS,AX						;регистра DS
		delay	5
		outstring	m1,3					;Вывести строку m1, 3 байта		
		delay	10							;Задержка на 10 секунд
		outstring	m2,4					;Вывести строку m2, 4 байта
		delay	5							;Задержка на 5 секунд
		outstring	m3,1					;Вывести строку m3, 1 байт
		
;-----------------------------------------------------------------------------------------------------------------
	outprog:	mov		AH,4Ch									;номер функции завершения в AH
				mov		AL,00h									;код завершения 
				int		21h										;прерывание MS DOS, которое при
																;наличии функции 4Сh в байте AH
																;обеспечивает возврат в систему
		
	myproc	endp
;==================================================================================================================
end	myproc
;==================================================================================================================