;====== Программа 18   Файл z6_pr18.asm ====================
;==================================================================================================================
include	macro.lib

MASM 
MODEL	tiny 
;==================================================================================================================
.data 																	
;Поля данных
;------------------------------------------------------------------------------------------------------------------
	m1	db		'<> '
	m2	db		'*** '
	m3	db		'!'
;==================================================================================================================
.code
		org		100h						;Начало главной процедуры
myproc	proc
		mov		AX,@data					;Инициализация сегментного 
		mov		DS,AX						;регистра DS
		delay	5
		outstring	m1,3					;Вывести строку m1, 3 байта		
		delay	10							;Задержка на 10 секунд
		outstring	m2,4					;Вывести строку m2, 4 байта
		delay	5							;Задержка на 5 секунд
		outstring	m3,1					;Вывести строку m3, 1 байт
		
;-----------------------------------------------------------------------------------------------------------------
	outprog:	mov		AH,4Ch									;номер функции завершения в AH
				mov		AL,00h									;код завершения 
				int		21h										;прерывание MS DOS, которое при
																;наличии функции 4Сh в байте AH
																;обеспечивает возврат в систему
		
	myproc	endp
;==================================================================================================================
end	myproc
;==================================================================================================================