;====== Программа 14.  Файл z4_pr14.asm ====================
;------------------------------------------------------------------------------------------------------------
																;Макросы
OUTPUT	MACRO	MS, LN											;Принимает строку и ее длину
			mov		AH,	40h										;номер функции вывода в байт AH
			mov		BX,1										;дискриптор монитора в регистр BX
			mov		CX,LN										;длину сообщения в регистр CX
			mov		DX,offset MS								;адрес (смещение) mes в регистр DX
			int		21h											;прерывание MS DOS, которое при
																;наличии функции 40h в байте AH
																;выводит строку на экран 
																;Завершение программы – возвращение в родительский процесс
			ENDM
;----------------------------------------------------------------------------------
masm 
model tiny 
;----------------------------------------------------------------------------------
stdout		equ		1 
lf			equ		10											;код ASCII перевода строки  
cr			equ		13											;код  ASCII возврата каретки
;==================================================================================
.data
N 		equ 10
mes		db N dup(49, 57, 56, 53, 50, 48, 55, 52, 51, 54)

.code         
		org     100h 	
main	proc
;-----------------------------------------------------------------------------------------------
	OUTPUT	mes N
	OUTPUT	' ' 1
;-----------------------------------------------------------------------------------------------

mov CX,N
out_c: push	CX
	xor		SI,SI
	mov		CX, N-1
in_c:
	mov		AH,mes[SI]
	mov		AL,mes[SI+1]
	cmp		AH,AL
	jnae	noswap
	xchg	AH,AL
	mov		mes[SI],AH
	mov		mes[SI+1],AL
noswap:
	inc		SI
	loop	in_c
	pop		CX
	loop	out_c
	
;-----------------------------------------------------------------------------------------------
	OUTPUT	mes N
;===============================================================================================
outprog:	mov		AH,4Ch										;номер функции завершения в AH
			mov		AL,00h										;код завершения 
			int		21h											;прерывание MS DOS, которое при
																;наличии функции 4Сh в байте AH
																;обеспечивает возврат в систему

main		endp
;---------------------------------------------------------------------------------

;---------------------------------------------------------------------------------
end		main
;=================================================================================